test/load/08.txt
/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

-
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 35 ms │ 129 ms │ 407 ms │ 578 ms │ 168.66 ms │ 433.55 ms │ 9987 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 2,113  │ 2,113  │ 3,413   │ 4,067   │ 3,402.5 │ 434.45 │ 2,113  │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 3.1 MB │ 3.1 MB │ 5.01 MB │ 5.97 MB │ 4.99 MB │ 638 kB │ 3.1 MB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 68036 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 9            │
├────────────┼──────────────┤
│ 0.01       │ 20           │
├────────────┼──────────────┤
│ 0.1        │ 26           │
├────────────┼──────────────┤
│ 1          │ 33           │
├────────────┼──────────────┤
│ 2.5        │ 35           │
├────────────┼──────────────┤
│ 10         │ 52           │
├────────────┼──────────────┤
│ 25         │ 81           │
├────────────┼──────────────┤
│ 50         │ 129          │
├────────────┼──────────────┤
│ 75         │ 151          │
├────────────┼──────────────┤
│ 90         │ 261          │
├────────────┼──────────────┤
│ 97.5       │ 407          │
├────────────┼──────────────┤
│ 99         │ 578          │
├────────────┼──────────────┤
│ 99.9       │ 7902         │
├────────────┼──────────────┤
│ 99.99      │ 9801         │
├────────────┼──────────────┤
│ 99.999     │ 9987         │
└────────────┴──────────────┘

69k requests in 20.08s, 99.9 MB read
128 errors (28 timeouts)

Process finished with exit code 0