test/load/09.txt
mebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

|
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 36 ms │ 126 ms │ 560 ms │ 962 ms │ 187.34 ms │ 459.23 ms │ 9580 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 1,035   │ 1,035   │ 3,339  │ 4,219   │ 3,159.3 │ 900.02  │ 1,035   │
├───────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 1.52 MB │ 1.52 MB │ 4.9 MB │ 6.19 MB │ 4.64 MB │ 1.32 MB │ 1.52 MB │
└───────────┴─────────┴─────────┴────────┴─────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 63181 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 3            │
├────────────┼──────────────┤
│ 0.01       │ 22           │
├────────────┼──────────────┤
│ 0.1        │ 27           │
├────────────┼──────────────┤
│ 1          │ 32           │
├────────────┼──────────────┤
│ 2.5        │ 36           │
├────────────┼──────────────┤
│ 10         │ 50           │
├────────────┼──────────────┤
│ 25         │ 75           │
├────────────┼──────────────┤
│ 50         │ 126          │
├────────────┼──────────────┤
│ 75         │ 162          │
├────────────┼──────────────┤
│ 90         │ 296          │
├────────────┼──────────────┤
│ 97.5       │ 560          │
├────────────┼──────────────┤
│ 99         │ 962          │
├────────────┼──────────────┤
│ 99.9       │ 7949         │
├────────────┼──────────────┤
│ 99.99      │ 9420         │
├────────────┼──────────────┤
│ 99.999     │ 9580         │
└────────────┴──────────────┘

64k requests in 20.04s, 92.7 MB read
103 errors (0 timeouts)

Process finished with exit code 0