test/load/10.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

-
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 64 ms │ 148 ms │ 511 ms │ 764 ms │ 210.22 ms │ 485.65 ms │ 9970 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 1,699   │ 1,699   │ 2,469   │ 3,505   │ 2,594.75 │ 553.7  │ 1,699   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 2.49 MB │ 2.49 MB │ 3.62 MB │ 5.15 MB │ 3.81 MB  │ 813 kB │ 2.49 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 51888 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 15           │
├────────────┼──────────────┤
│ 0.01       │ 17           │
├────────────┼──────────────┤
│ 0.1        │ 20           │
├────────────┼──────────────┤
│ 1          │ 31           │
├────────────┼──────────────┤
│ 2.5        │ 64           │
├────────────┼──────────────┤
│ 10         │ 87           │
├────────────┼──────────────┤
│ 25         │ 127          │
├────────────┼──────────────┤
│ 50         │ 148          │
├────────────┼──────────────┤
│ 75         │ 189          │
├────────────┼──────────────┤
│ 90         │ 287          │
├────────────┼──────────────┤
│ 97.5       │ 511          │
├────────────┼──────────────┤
│ 99         │ 764          │
├────────────┼──────────────┤
│ 99.9       │ 8138         │
├────────────┼──────────────┤
│ 99.99      │ 9767         │
├────────────┼──────────────┤
│ 99.999     │ 9970         │
└────────────┴──────────────┘

53k requests in 20.12s, 76.2 MB read
139 errors (55 timeouts)

Process finished with exit code 0